import string

thai_char = [ 'ก','ข','ฃ','ค','ฅ','ฆ','ง','จ','ฉ','ช','ซ','ฌ','ญ','ฎ','ฏ','ฐ','ฑ','ฒ','ณ','ด','ต','ถ','ท','ธ','น','บ','ป','ผ','ฝ','พ','ฟ','ภ','ม','ย','ร','ล','ว','ศ','ษ','ส','ห','ฬ','อ','ฮ' ]
thai_vowel = ['ะ','ั','า','ํ','ิ','ุ','ู','เ','โ','ใ','ไ','็']
thai_tonal = ['่','้','๊','๋']

eng_char = list(string.ascii_lowercase)
digit = ['0','1','2','3','4','5','6','7','8','9']

all = thai_char + thai_vowel + thai_tonal + eng_char + digit
print(len("า. บริษัทในเครือของการรถไฟตุรกี, yüksek hızlı tren เป็นผู้ประกอบการในเชิงพาณิชย์แต่เพียงผู้เดียวของรถไฟความเร็วสูงในตุรกี. การก่อสร้างของสางของจุดมุ่งหมายทางยุทธศ"))